# ~/.dotfiles/homebrew/Brewfile



#-----------------------------------------------------------------------------
#- Taps
#-----------------------------------------------------------------------------

#tap homebrew/cask-fonts
tap 'burntushi/ripgrep'
tap 'homebrew/cask-versions'



#-----------------------------------------------------------------------------
#- Formulas
#-----------------------------------------------------------------------------

brew 'bat'
brew 'composer'
brew 'curl'
brew 'deno'
brew 'docker'
brew 'git'
brew 'gnupg'
brew 'graphviz'
brew 'grep'
brew 'mas'
brew 'neovim'
brew 'node'
brew 'node-sass'
brew 'php'
brew 'pinentry-mac'
brew 'plantuml'
brew 'ripgrep'
brew 'sqlite'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'koekeishiya/formulae/yabai'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'



#-----------------------------------------------------------------------------
#- Casks
#-----------------------------------------------------------------------------

cask 'aldente'
cask 'alfred'
cask 'apparency'
cask 'bartender'
cask 'displaylink'
cask 'figma'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'font-meslo-lg-nerd-font'
cask 'font-space-mono-nerd-font'
cask 'google-chrome'
cask 'intellij-idea-ce'
cask 'istat-menus'
cask 'iterm2'
cask 'karabiner-elements'
cask 'macpass'
cask 'microsoft-edge'
cask 'nordpass'
cask 'nordvpn'
cask 'opera'
cask 'phpstorm'
cask 'polypane'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'raycast'
cask 'suspicious-package'



#-----------------------------------------------------------------------------
#- Mac App Store
#-----------------------------------------------------------------------------

mas 'Caffeinated - Anti Sleep App', id: 1362171212
mas 'Cleaner One Pro - Disk Clean', id: 1133028347
mas 'Dato', id: 1470584107
mas 'MonitorControlLite', id: 1595464182
mas 'Ad Block One', id: 1491889901
mas 'PDF Expert – Lesen, bearbeiten', id: 1055273043
mas 'Twilio Authy', id: 494168017
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'duoCo StripX', id: 1498448200
mas 'Elgato Control Center', id: 1446254313
mas 'Govee Studio', id: 1551073370




