#------------------------------------------------------------------------------
#----- Taps

#tap homebrew/cask-fonts
tap 'burntushi/ripgrep'
tap 'homebrew/cask-versions'



#------------------------------------------------------------------------------
#----- Formulas

brew 'ansible'
brew 'bat'
brew 'composer'
brew 'curl'
brew 'deno'
brew 'docker'
brew 'eza'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'graphviz'
brew 'grep'
brew 'mas'
brew 'MonitorControl'
brew 'neovim'
#brew 'node'
brew 'node-sass'
brew 'nvm'
brew 'php'
brew 'pinentry-mac'
brew 'plantuml'
brew 'pngpaste'
brew 'ripgrep'
brew 'sqlite'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vue-cli'
brew 'wget'
brew 'yarn'
brew 'koekeishiya/formulae/yabai'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'



#------------------------------------------------------------------------------
#----- Casks

cask 'alacritty'
cask 'aldente'
cask 'alfred'
cask 'apparency'
cask 'bartender'
cask 'displaylink'
cask 'figma'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'font-meslo-lg-nerd-font'
cask 'font-space-mono-nerd-font'
cask 'google-chrome'
cask 'istat-menus'
cask 'karabiner-elements'
cask 'logi-options-plus'
cask 'macpass'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'nordpass'
cask 'nordvpn'
cask 'opera'
cask 'polypane'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'raycast'
cask 'suspicious-package'



#------------------------------------------------------------------------------
#----- Mac App Store

mas 'Cleaner One Pro - Disk Clean',   id: 1133028347
mas 'Dato',                           id: 1470584107
mas 'Ad Block One',                   id: 1491889901
mas 'Numbers',                        id: 409203825
mas 'Pages',                          id: 409201541
mas 'Theine',                         id: 955848755
mas 'Keystroke Pro',                  id: 1572206224
mas 'Cursor Pro',                     id: 1447043133
mas 'Mirror Magnet',                  id: 1563698880
mas 'Presentify - Screen Annotation', id: 1507246666
